Revit 2024 API
ViewSchedule.SetSegmentHeight Method
 Sets the segment height.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022.1
Syntax
C#
public void SetSegmentHeight(
	int segmentIndex,
	double height
)
Visual Basic
Public Sub SetSegmentHeight ( _
	segmentIndex As Integer, _
	height As Double _
)
Visual C++
public:
void SetSegmentHeight(
	int segmentIndex,
	double height
)
Parameters
segmentIndex
Type: System.Int32
 Index of the segment.
height
Type: System.Double
 New height for the segment.
Remarks
 The height is Revit's internal units value of schedule header and segment body. The last segment can not set height. Its height will be determined by whole schedule height and other segments' heights. The height will not be the exact segment height on sheet. It will be the border height of the instance. The real height will be determined by the segment content. If the row cannot be shown within the instance boder, it will flow to the next segment.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  segmentIndex must be between 0 and the last second of all segments.
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  The given value for height must be greater than 0 and no more than 30000 feet.
See Also
ViewSchedule Class
Autodesk.Revit.DB Namespace